In [1]:
import numpy as np
import pandas as pd

In [2]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data1': range(6),
                   'data2': rng.randint(0,10,6)},
                  columns =['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [3]:
df.groupby('key').aggregate([min,np.median,max])

C:\Users\nimad\AppData\Local\Temp\ipykernel_16496\2943854441.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\nimad\AppData\Local\Temp\ipykernel_16496\2943854441.py:1: FutureWarning: The provided callable <function median at 0x000002137653D300> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\nimad\AppData\Local\Temp\ipykernel_16496\2943854441.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate([min,np.median,max])
C:\Users\nimad\AppData\Local\Temp\ipykernel_16496\2943854441.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('key').aggregate([min,np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [4]:
df.groupby('key').aggregate({'data1':'min',
                             'data2':'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [7]:
df.groupby('key').transform(lambda x: x-x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [8]:
from datetime import datetime

datetime(year=2016, month=7, day = 24)

datetime.datetime(2016, 7, 24, 0, 0)

In [9]:
from dateutil import parser
date = parser.parse("3rd of May, 2019")
date

datetime.datetime(2019, 5, 3, 0, 0)

In [10]:
date.strftime('%A')

'Friday'

In [11]:
date = pd.to_datetime('5th of August, 1963')
date

Timestamp('1963-08-05 00:00:00')

In [12]:
date.strftime('%A')

'Monday'

In [15]:
date + pd.to_timedelta(np.arange(10),'H')

C:\Users\nimad\AppData\Local\Temp\ipykernel_16496\3592071386.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version. Please use 'h' instead of 'H'.
  date + pd.to_timedelta(np.arange(10),'H')

DatetimeIndex(['1963-08-05 00:00:00', '1963-08-05 01:00:00',
               '1963-08-05 02:00:00', '1963-08-05 03:00:00',
               '1963-08-05 04:00:00', '1963-08-05 05:00:00',
               '1963-08-05 06:00:00', '1963-08-05 07:00:00',
               '1963-08-05 08:00:00', '1963-08-05 09:00:00'],
              dtype='datetime64[ns]', freq=None)

In [16]:
index = pd.DatetimeIndex(['2015-4-25','2015-6-3','2016-7-19','2016-9-20'])

data = pd.Series([0,1,2,3], index= index)

In [17]:
data

2015-04-25    0
2015-06-03    1
2016-07-19    2
2016-09-20    3
dtype: int64

In [20]:
data['2015-4-25':'2016-7-19']

2015-04-25    0
2015-06-03    1
2016-07-19    2
dtype: int64

In [22]:
data['2016']

2016-07-19    2
2016-09-20    3
dtype: int64

In [23]:
dates = pd.to_datetime([datetime(2016,2,28), '15th of July, 2020','2018-Jun-5', '08-06-2017', '20140304'])
dates

DatetimeIndex(['2016-02-28', '2020-07-15', '2018-06-05', '2017-08-06',
               '2014-03-04'],
              dtype='datetime64[ns]', freq=None)

In [24]:
pd.period_range('2016-7', periods = 7 , freq='M')

PeriodIndex(['2016-07', '2016-08', '2016-09', '2016-10', '2016-11', '2016-12',
             '2017-01'],
            dtype='period[M]')

In [25]:
ls

 Volume in drive C is Acer
 Volume Serial Number is 2E0D-DA93

 Directory of C:\Users\nimad\Documents\python\class activities

09/04/2024  07:42 AM    <DIR>          .
08/28/2024  11:52 AM    <DIR>          ..
09/04/2024  06:58 AM    <DIR>          .ipynb_checkpoints
09/03/2024  08:00 AM            12,519 class10.ipynb
09/04/2024  07:38 AM            17,954 class11.ipynb
08/21/2024  07:10 AM             2,109 class3.ipynb
08/25/2024  07:57 AM            15,480 class4.ipynb
08/27/2024  08:00 AM            40,032 class5.ipynb
08/28/2024  07:30 AM            43,241 class6.ipynb
08/29/2024  08:00 AM            28,873 class7.ipynb
09/01/2024  07:56 AM            41,811 class8.ipynb
09/03/2024  07:43 AM           216,489 class9.ipynb
08/18/2024  08:00 AM             1,664 Day1.ipynb
08/20/2024  07:51 AM            11,298 day2.ipynb
09/04/2024  07:42 AM            18,941 MSFT.csv
08/27/2024  07:04 AM               988 president_heights.csv
08/27/2024  07:47 AM            45,488 Seattle2014.csv
09/03/2024  07:04 AM               872 state-abbrevs.csv
09/03/2024  07:04 AM               835 state-areas.csv
09/03/2024  07:04 AM            57,935 state-population.csv
08/27/2024  07:42 AM             1,240 Untitled.ipynb
              18 File(s)        557,769 bytes
               3 Dir(s)  396,468,985,856 bytes free

In [26]:
msft = pd.read_csv('MSFT.csv')
msft.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
247,2022-08-09,279.640015,283.079987,277.609985,282.299988,282.299988,23405200
248,2022-08-10,288.170013,289.809998,286.940002,289.160004,289.160004,24687800
249,2022-08-11,290.850006,291.209991,286.510010,287.019989,287.019989,20065900
250,2022-08-12,288.480011,291.910004,286.940002,291.910004,291.910004,22601900
251,2022-08-15,291.000000,294.179993,290.109985,293.470001,293.470001,18072100

In [27]:
msft.set_index('Date', inplace = True)
msft.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2021-08-16,293.190002,294.820007,290.019989,294.600006,292.213959,22507600
2021-08-17,292.390015,293.429993,291.079987,293.079987,290.706207,20075300
2021-08-18,292.040009,294.820007,290.269989,290.730011,288.927338,21813000
2021-08-19,288.690002,297.470001,288.640015,296.769989,294.929871,29850500
2021-08-20,299.720001,305.839996,298.059998,304.359985,302.472809,40817600